zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_MRU0.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_CPE_MRU0.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_CPE_MRU0
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_CPE_MRU0_H_)  /* Check if memory map has not been already included */
#define S32K566_CPE_MRU0_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- CPE_MRU0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CPE_MRU0_Peripheral_Access_Layer CPE_MRU0 Peripheral Access Layer
 * @{
 */

/** CPE_MRU0 - Size of Registers Arrays */
#define CPE_MRU0_CHXCONFIG_COUNT                  6u
#define CPE_MRU0_NOTIFY_COUNT                     4u

/** CPE_MRU0 - Register Layout Typedef */
typedef struct CPE_MRU0_Struct {
  struct CPE_MRU0_CHXCONFIG {                      /* offset: 0x0, array step: 0x10 */
    __IO uint32_t CH_CFG0;                           /**< Channel (x) Configuration 0, array offset: 0x0, array step: 0x10 */
    __IO uint32_t CH_CFG1;                           /**< Channel (x) Configuration 1, array offset: 0x4, array step: 0x10 */
    __IO uint32_t CH_MBSTAT;                         /**< Channel (x) Mailbox Status, array offset: 0x8, array step: 0x10 */
    uint8_t RESERVED_0[4];
  } CHXCONFIG[CPE_MRU0_CHXCONFIG_COUNT];
  uint8_t RESERVED_0[416];
  __I  uint32_t NOTIFY[CPE_MRU0_NOTIFY_COUNT];     /**< Notification 0 Status..Notification 3 Status, array offset: 0x200, array step: 0x4 */
  uint8_t RESERVED_1[15856];
  __IO uint32_t CH1_MB0;                           /**< Channel (x) Mailbox (n), offset: 0x4000 */
  __IO uint32_t CH1_MB1;                           /**< Channel (x) Mailbox (n), offset: 0x4004 */
  __IO uint32_t CH1_MB2;                           /**< Channel (x) Mailbox (n), offset: 0x4008 */
  __IO uint32_t CH1_MB3;                           /**< Channel (x) Mailbox (n), offset: 0x400C */
  uint8_t RESERVED_2[16368];
  __IO uint32_t CH2_MB0;                           /**< Channel (x) Mailbox (n), offset: 0x8000 */
  __IO uint32_t CH2_MB1;                           /**< Channel (x) Mailbox (n), offset: 0x8004 */
  __IO uint32_t CH2_MB2;                           /**< Channel (x) Mailbox (n), offset: 0x8008 */
  __IO uint32_t CH2_MB3;                           /**< Channel (x) Mailbox (n), offset: 0x800C */
  uint8_t RESERVED_3[16368];
  __IO uint32_t CH3_MB0;                           /**< Channel (x) Mailbox (n), offset: 0xC000 */
  __IO uint32_t CH3_MB1;                           /**< Channel (x) Mailbox (n), offset: 0xC004 */
  __IO uint32_t CH3_MB2;                           /**< Channel (x) Mailbox (n), offset: 0xC008 */
  __IO uint32_t CH3_MB3;                           /**< Channel (x) Mailbox (n), offset: 0xC00C */
  uint8_t RESERVED_4[16368];
  __IO uint32_t CH4_MB0;                           /**< Channel (x) Mailbox (n), offset: 0x10000 */
  __IO uint32_t CH4_MB1;                           /**< Channel (x) Mailbox (n), offset: 0x10004 */
  __IO uint32_t CH4_MB2;                           /**< Channel (x) Mailbox (n), offset: 0x10008 */
  __IO uint32_t CH4_MB3;                           /**< Channel (x) Mailbox (n), offset: 0x1000C */
  uint8_t RESERVED_5[16368];
  __IO uint32_t CH5_MB0;                           /**< Channel (x) Mailbox (n), offset: 0x14000 */
  __IO uint32_t CH5_MB1;                           /**< Channel (x) Mailbox (n), offset: 0x14004 */
  __IO uint32_t CH5_MB2;                           /**< Channel (x) Mailbox (n), offset: 0x14008 */
  __IO uint32_t CH5_MB3;                           /**< Channel (x) Mailbox (n), offset: 0x1400C */
  uint8_t RESERVED_6[16368];
  __IO uint32_t CH6_MB0;                           /**< Channel (x) Mailbox (n), offset: 0x18000 */
  __IO uint32_t CH6_MB1;                           /**< Channel (x) Mailbox (n), offset: 0x18004 */
  __IO uint32_t CH6_MB2;                           /**< Channel (x) Mailbox (n), offset: 0x18008 */
  __IO uint32_t CH6_MB3;                           /**< Channel (x) Mailbox (n), offset: 0x1800C */
} CPE_MRU0_Type, *CPE_MRU0_MemMapPtr;

/** Number of instances of the CPE_MRU0 module. */
#define CPE_MRU0_INSTANCE_COUNT                  (1u)

/* CPE_MRU0 - Peripheral instance base addresses */
/** Peripheral CPE_MRU_0 base address */
#define IP_CPE_MRU_0_BASE                        (0x41018000u)
/** Peripheral CPE_MRU_0 base pointer */
#define IP_CPE_MRU_0                             ((CPE_MRU0_Type *)IP_CPE_MRU_0_BASE)
/** Array initializer of CPE_MRU0 peripheral base addresses */
#define IP_CPE_MRU0_BASE_ADDRS                   { IP_CPE_MRU_0_BASE }
/** Array initializer of CPE_MRU0 peripheral base pointers */
#define IP_CPE_MRU0_BASE_PTRS                    { IP_CPE_MRU_0 }

/* ----------------------------------------------------------------------------
   -- CPE_MRU0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CPE_MRU0_Register_Masks CPE_MRU0 Register Masks
 * @{
 */

/*! @name CH_CFG0 - Channel (x) Configuration 0 */
/*! @{ */

