zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_MRU0.h
#define CPE_MRU0_CH_CFG0_CHE_MASK                (0x1U)
#define CPE_MRU0_CH_CFG0_CHE_SHIFT               (0U)
#define CPE_MRU0_CH_CFG0_CHE_WIDTH               (1U)
#define CPE_MRU0_CH_CFG0_CHE(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_CFG0_CHE_SHIFT)) & CPE_MRU0_CH_CFG0_CHE_MASK)

#define CPE_MRU0_CH_CFG0_CHR_MASK                (0x2U)
#define CPE_MRU0_CH_CFG0_CHR_SHIFT               (1U)
#define CPE_MRU0_CH_CFG0_CHR_WIDTH               (1U)
#define CPE_MRU0_CH_CFG0_CHR(x)                  (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_CFG0_CHR_SHIFT)) & CPE_MRU0_CH_CFG0_CHR_MASK)

#define CPE_MRU0_CH_CFG0_IE_MASK                 (0x4U)
#define CPE_MRU0_CH_CFG0_IE_SHIFT                (2U)
#define CPE_MRU0_CH_CFG0_IE_WIDTH                (1U)
#define CPE_MRU0_CH_CFG0_IE(x)                   (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_CFG0_IE_SHIFT)) & CPE_MRU0_CH_CFG0_IE_MASK)

#define CPE_MRU0_CH_CFG0_MBE0_MASK               (0x10000U)
#define CPE_MRU0_CH_CFG0_MBE0_SHIFT              (16U)
#define CPE_MRU0_CH_CFG0_MBE0_WIDTH              (1U)
#define CPE_MRU0_CH_CFG0_MBE0(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_CFG0_MBE0_SHIFT)) & CPE_MRU0_CH_CFG0_MBE0_MASK)

#define CPE_MRU0_CH_CFG0_MBE1_MASK               (0x20000U)
#define CPE_MRU0_CH_CFG0_MBE1_SHIFT              (17U)
#define CPE_MRU0_CH_CFG0_MBE1_WIDTH              (1U)
#define CPE_MRU0_CH_CFG0_MBE1(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_CFG0_MBE1_SHIFT)) & CPE_MRU0_CH_CFG0_MBE1_MASK)

#define CPE_MRU0_CH_CFG0_MBE2_MASK               (0x40000U)
#define CPE_MRU0_CH_CFG0_MBE2_SHIFT              (18U)
#define CPE_MRU0_CH_CFG0_MBE2_WIDTH              (1U)
#define CPE_MRU0_CH_CFG0_MBE2(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_CFG0_MBE2_SHIFT)) & CPE_MRU0_CH_CFG0_MBE2_MASK)

#define CPE_MRU0_CH_CFG0_MBE3_MASK               (0x80000U)
#define CPE_MRU0_CH_CFG0_MBE3_SHIFT              (19U)
#define CPE_MRU0_CH_CFG0_MBE3_WIDTH              (1U)
#define CPE_MRU0_CH_CFG0_MBE3(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_CFG0_MBE3_SHIFT)) & CPE_MRU0_CH_CFG0_MBE3_MASK)
/*! @} */

/*! @name CH_CFG1 - Channel (x) Configuration 1 */
/*! @{ */

#define CPE_MRU0_CH_CFG1_MBIC0_MASK              (0x3U)
#define CPE_MRU0_CH_CFG1_MBIC0_SHIFT             (0U)
#define CPE_MRU0_CH_CFG1_MBIC0_WIDTH             (2U)
#define CPE_MRU0_CH_CFG1_MBIC0(x)                (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_CFG1_MBIC0_SHIFT)) & CPE_MRU0_CH_CFG1_MBIC0_MASK)

#define CPE_MRU0_CH_CFG1_MBIC1_MASK              (0xCU)
#define CPE_MRU0_CH_CFG1_MBIC1_SHIFT             (2U)
#define CPE_MRU0_CH_CFG1_MBIC1_WIDTH             (2U)
#define CPE_MRU0_CH_CFG1_MBIC1(x)                (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_CFG1_MBIC1_SHIFT)) & CPE_MRU0_CH_CFG1_MBIC1_MASK)

#define CPE_MRU0_CH_CFG1_MBIC2_MASK              (0x30U)
#define CPE_MRU0_CH_CFG1_MBIC2_SHIFT             (4U)
#define CPE_MRU0_CH_CFG1_MBIC2_WIDTH             (2U)
#define CPE_MRU0_CH_CFG1_MBIC2(x)                (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_CFG1_MBIC2_SHIFT)) & CPE_MRU0_CH_CFG1_MBIC2_MASK)

#define CPE_MRU0_CH_CFG1_MBIC3_MASK              (0xC0U)
#define CPE_MRU0_CH_CFG1_MBIC3_SHIFT             (6U)
#define CPE_MRU0_CH_CFG1_MBIC3_WIDTH             (2U)
#define CPE_MRU0_CH_CFG1_MBIC3(x)                (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_CFG1_MBIC3_SHIFT)) & CPE_MRU0_CH_CFG1_MBIC3_MASK)
/*! @} */

/*! @name CH_MBSTAT - Channel (x) Mailbox Status */
/*! @{ */

#define CPE_MRU0_CH_MBSTAT_MBS0_MASK             (0x10000U)
#define CPE_MRU0_CH_MBSTAT_MBS0_SHIFT            (16U)
#define CPE_MRU0_CH_MBSTAT_MBS0_WIDTH            (1U)
#define CPE_MRU0_CH_MBSTAT_MBS0(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_MBSTAT_MBS0_SHIFT)) & CPE_MRU0_CH_MBSTAT_MBS0_MASK)

#define CPE_MRU0_CH_MBSTAT_MBS1_MASK             (0x20000U)
#define CPE_MRU0_CH_MBSTAT_MBS1_SHIFT            (17U)
#define CPE_MRU0_CH_MBSTAT_MBS1_WIDTH            (1U)
#define CPE_MRU0_CH_MBSTAT_MBS1(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_MBSTAT_MBS1_SHIFT)) & CPE_MRU0_CH_MBSTAT_MBS1_MASK)

#define CPE_MRU0_CH_MBSTAT_MBS2_MASK             (0x40000U)
#define CPE_MRU0_CH_MBSTAT_MBS2_SHIFT            (18U)
#define CPE_MRU0_CH_MBSTAT_MBS2_WIDTH            (1U)
#define CPE_MRU0_CH_MBSTAT_MBS2(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_MBSTAT_MBS2_SHIFT)) & CPE_MRU0_CH_MBSTAT_MBS2_MASK)

#define CPE_MRU0_CH_MBSTAT_MBS3_MASK             (0x80000U)
#define CPE_MRU0_CH_MBSTAT_MBS3_SHIFT            (19U)
#define CPE_MRU0_CH_MBSTAT_MBS3_WIDTH            (1U)
#define CPE_MRU0_CH_MBSTAT_MBS3(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_CH_MBSTAT_MBS3_SHIFT)) & CPE_MRU0_CH_MBSTAT_MBS3_MASK)
/*! @} */

/*! @name NOTIFY - Notification 0 Status..Notification 3 Status */
/*! @{ */

#define CPE_MRU0_NOTIFY_CH1_IS0_MASK             (0x1U)
#define CPE_MRU0_NOTIFY_CH1_IS0_SHIFT            (0U)
#define CPE_MRU0_NOTIFY_CH1_IS0_WIDTH            (1U)
#define CPE_MRU0_NOTIFY_CH1_IS0(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_NOTIFY_CH1_IS0_SHIFT)) & CPE_MRU0_NOTIFY_CH1_IS0_MASK)

#define CPE_MRU0_NOTIFY_CH2_IS0_MASK             (0x2U)
#define CPE_MRU0_NOTIFY_CH2_IS0_SHIFT            (1U)
#define CPE_MRU0_NOTIFY_CH2_IS0_WIDTH            (1U)
#define CPE_MRU0_NOTIFY_CH2_IS0(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_NOTIFY_CH2_IS0_SHIFT)) & CPE_MRU0_NOTIFY_CH2_IS0_MASK)

#define CPE_MRU0_NOTIFY_CH3_IS0_MASK             (0x4U)
#define CPE_MRU0_NOTIFY_CH3_IS0_SHIFT            (2U)
#define CPE_MRU0_NOTIFY_CH3_IS0_WIDTH            (1U)
#define CPE_MRU0_NOTIFY_CH3_IS0(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_NOTIFY_CH3_IS0_SHIFT)) & CPE_MRU0_NOTIFY_CH3_IS0_MASK)

#define CPE_MRU0_NOTIFY_CH4_IS0_MASK             (0x8U)
#define CPE_MRU0_NOTIFY_CH4_IS0_SHIFT            (3U)
#define CPE_MRU0_NOTIFY_CH4_IS0_WIDTH            (1U)
#define CPE_MRU0_NOTIFY_CH4_IS0(x)               (((uint32_t)(((uint32_t)(x)) << CPE_MRU0_NOTIFY_CH4_IS0_SHIFT)) & CPE_MRU0_NOTIFY_CH4_IS0_MASK)

